Same issue; based on the message when replace is forced I did not want to actually execute the apply, for fear it would delete the valuable branch.
```
  # module.repo_axisnow_serviceworker2_branches.github_branch.branches["master"] must be replaced
-/+ resource "github_branch" "branches" {
      ~ etag          = "W/\"1255b40d....b1\"" -> (known after apply)
      ~ id            = "reponame:master" -> (known after apply)
      ~ ref           = "refs/heads/master" -> (known after apply)
      ~ sha           = "97095...." -> (known after apply)
      ~ source_branch = "main" -> "master" # forces replacement
      + source_sha    = (known after apply)
        # (2 unchanged attributes hidden)
    }
```

I pulled the state file, edited the serial and `"source_branch": "main",`  to `"source_branch": "master",` and pushed it back. Not an efficient workflow.

This was the result of an import with the `source_branch="master"` specified, and there was no `main` branch. Not sure how it ended up with `main`.